## Pandas  series

In [ ]:
import numpy as np
import pandas as pd
#pandas always store index as well values of element

In [ ]:
# 1) creating series using list

In [ ]:
l1= [10,12,20,30]

In [ ]:
pd.Series(l1)

0    10
1    12
2    20
3    30
dtype: int64

In [ ]:
labels=['a','b','c','d']
pd.Series(l1,labels)

a    10
b    12
c    20
d    30
dtype: int64

In [ ]:
#2) series using numpy

In [ ]:
arr=np.arange(1,11)
pd.Series(arr)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
## 3) pandas series using dictionary

In [ ]:
d={'a':100,'b':200,'c':300}
pd.Series(d)

a    100
b    200
c    300
dtype: int64

#Grab Info from pandas series

In [ ]:
ser1=pd.Series(data=[1,2,3,4],index=['red','green','yellow','blue'])
ser1

red       1
green     2
yellow    3
blue      4
dtype: int64

In [ ]:
ser1['red']

1

In [ ]:
ser2=pd.Series(data=[10,20,30,40])
ser2

0    10
1    20
2    30
3    40
dtype: int64

In [ ]:
ser2[1]

20

In [ ]:
ser3=pd.Series(data=[1,2,3,4],index=['red','violet','yellow','green'])
ser3

red       1
violet    2
yellow    3
green     4
dtype: int64

In [ ]:
ser1+ser3

blue      NaN
green     6.0
red       2.0
violet    NaN
yellow    6.0
dtype: float64

# Data Frames

In [ ]:
import numpy as np
from numpy.random import randn
np.random.seed(101)

In [ ]:
#dataframe is bunch of series which shares common index
df=pd.DataFrame(data=randn(5,4),index=['a','b','c','d','e'],columns=['w','x','y','z'])
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [ ]:
# 1) selecting and indexing dataframe

In [ ]:
# selecting columns
df['w']

a   -0.993263
b    1.025984
c    2.154846
d    0.147027
e   -0.925874
Name: w, dtype: float64

In [ ]:
type(df['w'])

pandas.core.series.Series

In [ ]:
# selecting multiple columns
df[['w','x']]

          w         x
a -0.993263  0.196800
b  1.025984 -0.156598
c  2.154846 -0.610259
d  0.147027 -0.479448
e -0.925874  1.862864

In [ ]:
# adding another new column
df['new']=df['w']+df['x']
df

          w         x         y         z       new
a -0.993263  0.196800 -1.136645  0.000366 -0.796464
b  1.025984 -0.156598 -0.031579  0.649826  0.869386
c  2.154846 -0.610259 -0.755325 -0.346419  1.544588
d  0.147027 -0.479448  0.558769  1.024810 -0.332421
e -0.925874  1.862864 -1.133817  0.610478  0.936990

In [ ]:
# removing column from the data frame
df.drop(labels=['new'],axis=1,inplace=True)
#axis 1 means deleting column for deleting row axis =0
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [ ]:
# deleting specific row
df.drop(labels=['b'],axis=0,inplace=True)
df

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

In [ ]:
# selecting row
df.loc['c']

w    2.154846
x   -0.610259
y   -0.755325
z   -0.346419
Name: c, dtype: float64

In [ ]:
# selecting multiple rows
df.loc[['a','c']]

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
c  2.154846 -0.610259 -0.755325 -0.346419

In [ ]:
# selecting subset
df.loc[['a','c'],['w','x']]

          w         x
a -0.993263  0.196800
c  2.154846 -0.610259

In [ ]:
# conditional selection

In [ ]:
import numpy as np
from numpy.random import randn
import pandas as pd
np.random.seed(101)

In [8]:
df=pd.DataFrame(randn(5,4),index=['a','b','c','d','e'],columns=['w','x','y','z'])

In [9]:
df>0

       w      x      y      z
a   True   True  False  False
b  False   True   True   True
c   True   True   True   True
d  False  False  False   True
e  False   True   True   True

In [10]:
df[df>0]

          w         x         y         z
a  0.302665  1.693723       NaN       NaN
b       NaN  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d       NaN       NaN       NaN  0.484752
e       NaN  1.901755  0.238127  1.996652

In [11]:
df[df['w']>0]

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
c  0.807706  0.072960  0.638787  0.329646

In [17]:
df[(df['w']>0) & (df['y']>0)]

          w        x         y         z
c  0.807706  0.07296  0.638787  0.329646

In [ ]:
# 3) Index

In [19]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [20]:
# for permenant reset set inplaced=True 
df.reset_index()

  index         w         x         y         z
0     a  0.302665  1.693723 -1.706086 -1.159119
1     b -0.134841  0.390528  0.166905  0.184502
2     c  0.807706  0.072960  0.638787  0.329646
3     d -0.497104 -0.754070 -0.943406  0.484752
4     e -0.116773  1.901755  0.238127  1.996652

In [22]:
# setting label as index
newlabel=['R','G','B','Y','G']
df['colors']=newlabel
df

          w         x         y         z colors
a  0.302665  1.693723 -1.706086 -1.159119      R
b -0.134841  0.390528  0.166905  0.184502      G
c  0.807706  0.072960  0.638787  0.329646      B
d -0.497104 -0.754070 -0.943406  0.484752      Y
e -0.116773  1.901755  0.238127  1.996652      G

In [25]:
# for setting it permanently you have to set inplaced=True
df.set_index('colors')

               w         x         y         z
colors
R       0.302665  1.693723 -1.706086 -1.159119
G      -0.134841  0.390528  0.166905  0.184502
B       0.807706  0.072960  0.638787  0.329646
Y      -0.497104 -0.754070 -0.943406  0.484752
G      -0.116773  1.901755  0.238127  1.996652

# Data frame 2

In [ ]:
# multi index frames

In [26]:
import pandas as pd
from numpy.random import randn

In [28]:
outside=['red','red','red','green','green','green']
inside=[1,2,3,1,2,3]
hir_index=list(zip(outside,inside))

In [30]:
hir_index

[('red', 1), ('red', 2), ('red', 3), ('green', 1), ('green', 2), ('green', 3)]

In [31]:
multi_index=pd.MultiIndex.from_tuples(hir_index,names=['colors','numbers'])

In [32]:
multi_index

MultiIndex([(  'red', 1),
            (  'red', 2),
            (  'red', 3),
            ('green', 1),
            ('green', 2),
            ('green', 3)],
           names=['colors', 'numbers'])

In [33]:
df=pd.DataFrame(data=randn(6,2),index=multi_index,columns=['A','B'])

In [34]:
df

                       A         B
colors numbers
red    1       -0.993263  0.196800
       2       -1.136645  0.000366
       3        1.025984 -0.156598
green  1       -0.031579  0.649826
       2        2.154846 -0.610259
       3       -0.755325 -0.346419

In [45]:
df.loc['red'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [46]:
# cross section
df.xs('red')

                A         B
numbers
1       -0.993263  0.196800
2       -1.136645  0.000366
3        1.025984 -0.156598

In [48]:
df.xs(key=1,level='numbers')

               A         B
colors
red    -0.993263  0.196800
green  -0.031579  0.649826

# 3) Missing Data

In [49]:
# In this section we will see how to deal with missing data 
import numpy as np
import pandas as pd

In [54]:
d={'A':[1,np.nan,2,4],'B':[3,np.nan,np.nan,6],'c':[6,7,8,9]}

In [55]:
df=pd.DataFrame(d)

In [56]:
df

     A    B  c
0  1.0  3.0  6
1  NaN  NaN  7
2  2.0  NaN  8
3  4.0  6.0  9

In [57]:
df.isna()

       A      B      c
0  False  False  False
1   True   True  False
2  False   True  False
3  False  False  False

In [ ]:
# you can drop the null value or fill the null value by mean or anything let see how to drop null
# dropna

In [65]:
df

     A    B  c
0  1.0  3.0  6
1  NaN  NaN  7
2  2.0  NaN  8
3  4.0  6.0  9

In [68]:
df.dropna()

     A    B  c
0  1.0  3.0  6
3  4.0  6.0  9

In [70]:
df.dropna(axis=1) # deleting horizontally

   c
0  6
1  7
2  8
3  9

In [71]:
df.fillna(value="new values")

            A           B  c
0           1           3  6
1  new values  new values  7
2           2  new values  8
3           4           6  9

In [74]:
df['A']=df['A'].fillna(value=df['A'].mean())
df

          A    B  c
0  1.000000  3.0  6
1  2.333333  NaN  7
2  2.000000  NaN  8
3  4.000000  6.0  9

# 4) Group by

In [75]:
myteam={'company':['apple','apple','fb','fb','google','google'],
         'person':['tom','mark','sara','mia','siya','jaya'],
        'sales':[100,200,300,150,200,350]
        }

In [76]:
myteam

{'company': ['apple', 'apple', 'fb', 'fb', 'google', 'google'],
 'person': ['tom', 'mark', 'sara', 'mia', 'siya', 'jaya'],
 'sales': [100, 200, 300, 150, 200, 350]}

In [77]:
df=pd.DataFrame(myteam)

In [78]:
df

  company person  sales
0   apple    tom    100
1   apple   mark    200
2      fb   sara    300
3      fb    mia    150
4  google   siya    200
5  google   jaya    350

In [83]:
b=df.groupby(by='company')

In [84]:
b.mean()

         sales
company
apple      150
fb         225
google     275

In [87]:
df.groupby(by='company').describe().transpose()

company           apple          fb      google
sales count    2.000000    2.000000    2.000000
      mean   150.000000  225.000000  275.000000
      std     70.710678  106.066017  106.066017
      min    100.000000  150.000000  200.000000
      25%    125.000000  187.500000  237.500000
      50%    150.000000  225.000000  275.000000
      75%    175.000000  262.500000  312.500000
      max    200.000000  300.000000  350.000000

In [88]:
df.groupby(by='company').max()

        person  sales
company
apple      tom    200
fb        sara    300
google    siya    350

# 5) operation

In [89]:
df

  company person  sales
0   apple    tom    100
1   apple   mark    200
2      fb   sara    300
3      fb    mia    150
4  google   siya    200
5  google   jaya    350

In [94]:
df['sales'].unique()

array([100, 200, 300, 150, 350])

In [95]:
df['sales'].nunique()

5

In [97]:
df.columns

Index(['company', 'person', 'sales'], dtype='object')

In [99]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [100]:
df.sort_values(by='sales')

  company person  sales
0   apple    tom    100
3      fb    mia    150
1   apple   mark    200
4  google   siya    200
2      fb   sara    300
5  google   jaya    350

# 6) Reading and Writing data

In [101]:
df

  company person  sales
0   apple    tom    100
1   apple   mark    200
2      fb   sara    300
3      fb    mia    150
4  google   siya    200
5  google   jaya    350

In [102]:
# writing to csv  ## insert data into dataframe
df.to_csv('test1.csv')

In [105]:
# read data from csv
newdf=pd.read_csv('test1.csv',index_col=0)

In [107]:
newdf

  company person  sales
0   apple    tom    100
1   apple   mark    200
2      fb   sara    300
3      fb    mia    150
4  google   siya    200
5  google   jaya    350

In [ ]:
#Reading and writing excel file

In [108]:
df.to_excel('test1.xlsx')

In [112]:
newdf2=pd.read_excel('test1.xlsx',index_col=0)

In [113]:
newdf2

  company person  sales
0   apple    tom    100
1   apple   mark    200
2      fb   sara    300
3      fb    mia    150
4  google   siya    200
5  google   jaya    350